{"class_name": "Model", "keras_version": "1.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 512}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "dense_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 10}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_4"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_1"}}